<!DOCTYPE html>
<html class="no-js" lang="en">
<head>
	<meta charset="UTF-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>一文了解各大图数据库查询语言（Gremlin vs Cypher vs nGQL）| 操作入门篇 - 编程大白的博客</title>
	<script>(function(d,e){d[e]=d[e].replace("no-js","js");})(document.documentElement,"className");</script>
	<meta name="description" content="">
		<meta property="og:title" content="一文了解各大图数据库查询语言（Gremlin vs Cypher vs nGQL）| 操作入门篇" />
<meta property="og:description" content="文章的开头我们先来看下什么是图数据库，根据维基百科的定义：图数据库是使用图结构进行语义查询的数据库，它使用节点、边和属性来表示和存储数据。
虽然和关系型数据库存储的结构不同（关系型数据库为表结构，图数据库为图结构），但不计各自的性能问题，关系型数据库可以通过递归查询或者组合其他 SQL 语句（Join）完成图查询语言查询节点关系操作。得益于 1987 年 SQL 成为国际标准化组织（ISO）标准，关系型数据库行业得到了很好的发展。同 60、70 年代的关系型数据库类似，图数据库这个领域的查询语言目前也没有统一标准，虽然 19 年 9 月经过国际 SQL 标准委员会投票表决，决定将图查询语言（Graph Query Language）纳为一种新的数据库查询语言，但 GQL 的制定仍需要一段时间。
[外链图片转存失败,源站可能有防盗链机制,建议将图片保存下来直接上传(img-FUrKYa4B-1583375942780)(https://user-images.githubusercontent.com/38887077/75741236-f357d380-5d44-11ea-8c43-65283b49bbef.png)]
介于市面上没有统一的图查询语言标准，在本文中我们选取市面上主流的几款图查询语言来分析一波用法，由于篇幅原因本文旨在简单介绍图查询语言和常规用法，更详细的内容将在进阶篇中讲述。
图查询语言·介绍 [外链图片转存失败,源站可能有防盗链机制,建议将图片保存下来直接上传(img-TXof8o9B-1583375942786)(https://user-images.githubusercontent.com/38887077/75741240-f5ba2d80-5d44-11ea-80f6-f44d39fff43a.png)]
图查询语言 Gremlin Gremlin 是 Apache ThinkerPop 框架下的图遍历语言。Gremlin 可以是声明性的也可以是命令性的。虽然 Gremlin 是基于 Groovy 的，但具有许多语言变体，允许开发人员以 Java、JavaScript、Python、Scala、Clojure 和 Groovy 等许多现代编程语言原生编写 Gremlin 查询。
支持图数据库：Janus Graph、InfiniteGraph、Cosmos DB、DataStax Enterprise(5.0&#43;) 、Amazon Neptune
图查询语言 Cypher Cypher 是一个描述性的图形查询语言，允许不必编写图形结构的遍历代码对图形存储有表现力和效率的查询，和 SQL 很相似，Cypher 语言的关键字不区分大小写，但是属性值，标签，关系类型和变量是区分大小写的。
支持图数据库： Neo4j、RedisGraph、AgensGraph
图查询语言 nGQL nGQL 是一种类 SQL 的声明型的文本查询语言，nGQL 同样是关键词大小写不敏感的查询语言，目前支持模式匹配、聚合运算、图计算，可无嵌入组合语句。
支持图数据库：Nebula Graph
图查询语言·术语篇 在比较这 3 个图查询语言之前，我们先来看看他们各自的术语，如果你翻阅他们的文档会经常见到下面这些“关键字”，在这里我们不讲用法，只看这些图数据库常用概念在这 3 个图数据库文档中的叫法。" />
<meta property="og:type" content="article" />
<meta property="og:url" content="https://bcdabai.github.io/posts/036327e521a6e64fb4a1427da5607831/" /><meta property="article:section" content="posts" />
<meta property="article:published_time" content="2020-03-05T10:46:47+08:00" />
<meta property="article:modified_time" content="2020-03-05T10:46:47+08:00" />


	<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
	<link rel="dns-prefetch" href="//fonts.googleapis.com">
	<link rel="dns-prefetch" href="//fonts.gstatic.com">
	<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans:400,400i,700">

	<link rel="stylesheet" href="/css/style.css">
	

	<link rel="shortcut icon" href="/favicon.ico">
		
</head>
<body class="body">
	<div class="container container--outer">
		<header class="header">
	<div class="container header__container">
		
	<div class="logo">
		<a class="logo__link" href="/" title="编程大白的博客" rel="home">
			<div class="logo__item logo__text">
					<div class="logo__title">编程大白的博客</div>
					
				</div>
		</a>
	</div>
		<div class="divider"></div>
	</div>
</header>
		<div class="wrapper flex">
			<div class="primary">
			
<main class="main" role="main">
	<article class="post">
		<header class="post__header">
			<h1 class="post__title">一文了解各大图数据库查询语言（Gremlin vs Cypher vs nGQL）| 操作入门篇</h1>
			
		</header>
		<div id="gatop"></div>
		<div class="content post__content clearfix">
			
<div id="content_views" class="markdown_views prism-atom-one-dark">
                    <svg xmlns="http://www.w3.org/2000/svg" style="display: none;">
                        <path stroke-linecap="round" d="M5,0 0,2.5 5,5z" id="raphael-marker-block" style="-webkit-tap-highlight-color: rgba(0, 0, 0, 0);"></path>
                    </svg>
                    <p>文章的开头我们先来看下什么是图数据库，根据维基百科的定义：<strong>图数据库是使用图结构进行语义查询的数据库，它使用节点、边和属性来表示和存储数据</strong>。</p> 
<p>虽然和关系型数据库存储的结构不同（关系型数据库为表结构，图数据库为图结构），但不计各自的性能问题，关系型数据库可以通过递归查询或者组合其他 SQL 语句（Join）完成图查询语言查询节点关系操作。得益于 1987 年 SQL 成为国际标准化组织（ISO）标准，关系型数据库行业得到了很好的发展。同 60、70 年代的关系型数据库类似，图数据库这个领域的查询语言目前也没有统一标准，虽然 19 年 9 月经过国际 SQL 标准委员会投票表决，决定将图查询语言（Graph Query Language）纳为一种新的数据库查询语言，但 GQL 的制定仍需要一段时间。</p> 
<p>[外链图片转存失败,源站可能有防盗链机制,建议将图片保存下来直接上传(img-FUrKYa4B-1583375942780)(https://user-images.githubusercontent.com/38887077/75741236-f357d380-5d44-11ea-8c43-65283b49bbef.png)]</p> 
<p>介于市面上没有统一的图查询语言标准，在本文中我们选取市面上主流的几款图查询语言来分析一波用法，由于篇幅原因本文旨在简单介绍图查询语言和常规用法，更详细的内容将在进阶篇中讲述。</p> 
<h3><a id="_8"></a>图查询语言·介绍</h3> 
<p>[外链图片转存失败,源站可能有防盗链机制,建议将图片保存下来直接上传(img-TXof8o9B-1583375942786)(https://user-images.githubusercontent.com/38887077/75741240-f5ba2d80-5d44-11ea-80f6-f44d39fff43a.png)]</p> 
<h4><a id="_Gremlin_12"></a>图查询语言 Gremlin</h4> 
<p><a href="https://tinkerpop.apache.org/gremlin.html" rel="nofollow">Gremlin</a> 是 Apache ThinkerPop 框架下的图遍历语言。Gremlin 可以是<strong>声明性</strong>的也可以是<strong>命令性</strong>的。虽然 Gremlin 是基于 Groovy 的，但具有许多语言变体，允许开发人员以 Java、JavaScript、Python、Scala、Clojure 和 Groovy 等许多现代编程语言<strong>原生编写 Gremlin 查询</strong>。</p> 
<p>支持图数据库：Janus Graph、InfiniteGraph、Cosmos DB、DataStax Enterprise(5.0+) 、Amazon Neptune</p> 
<h4><a id="_Cypher_18"></a>图查询语言 Cypher</h4> 
<p>Cypher 是一个描述性的图形查询语言，允许不必编写图形结构的遍历代码对图形存储有表现力和效率的查询，和 SQL 很相似，Cypher 语言的关键字不区分大小写，但是属性值，标签，关系类型和变量是区分大小写的。</p> 
<p>支持图数据库： Neo4j、RedisGraph、AgensGraph</p> 
<h4><a id="_nGQL_24"></a>图查询语言 nGQL</h4> 
<p><a href="https://github.com/vesoft-inc/nebula/blob/master/docs/manual-CN/1.overview/1.concepts/2.nGQL-overview.md">nGQL</a> 是一种类 SQL 的声明型的文本查询语言，nGQL 同样是关键词大小写不敏感的查询语言，目前支持模式匹配、聚合运算、图计算，可无嵌入组合语句。</p> 
<p>支持图数据库：Nebula Graph</p> 
<h3><a id="_30"></a>图查询语言·术语篇</h3> 
<p>在比较这 3 个图查询语言之前，我们先来看看他们各自的术语，如果你翻阅他们的文档会经常见到下面这些“关键字”，在这里我们不讲用法，只看这些图数据库常用概念在这 3 个图数据库文档中的叫法。</p> 
<table><thead><tr><th>术语</th><th>Gremlin</th><th>Cypher</th><th>nGQL</th></tr></thead><tbody><tr><td>点</td><td>Vertex</td><td>Node</td><td>Vertex</td></tr><tr><td>边</td><td>Edge</td><td>Relationship</td><td>Edge</td></tr><tr><td>点类型</td><td>Label</td><td>Label</td><td>Tag</td></tr><tr><td>边类型</td><td>label</td><td>RelationshipType</td><td>edge type</td></tr><tr><td>点 ID</td><td>vid</td><td>id(n)</td><td>vid</td></tr><tr><td>边 ID</td><td>eid</td><td>id®</td><td>无</td></tr><tr><td>插入</td><td>add</td><td>create</td><td>insert</td></tr><tr><td>删除</td><td>drop</td><td>delete</td><td>delete / drop</td></tr><tr><td>更新属性</td><td>setProperty</td><td>set</td><td>update</td></tr></tbody></table> 
<p>我们可以看到大体上对点和边的叫法类似，只不过 Cypher 中直接使用了 Relationship 关系一词代表边。其他的术语基本都非常直观。</p> 
<h3><a id="_49"></a>图查询语言·语法篇</h3> 
<p>了解过 Gremlin、Cypher、nGQL 中常见的术语之后，我们来看看使用这 3 个图查询语言过程中会需要了解的常规语法。</p> 
<h4><a id="_53"></a>图</h4> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 创建图</span>
g <span class="token operator">=</span> TinkerGraph.open<span class="token punctuation">(</span><span class="token punctuation">)</span>.traversal<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># nGQL 创建图空间</span>
CREATE SPACE gods
</code></pre> 
<h4><a id="_63"></a>点</h4> 
<p>图结构由点和边组成，一条边连接两个点。在 Gremlin 和 nGQL 中称之为 Vertex，Cypher 则称之为 Node。如何在图数据库中新建一个点呢？可以参考下面的语法</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 创建/插入点</span>
g.addV<span class="token punctuation">(</span>vertexLabel<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 创建点</span>
CREATE <span class="token punctuation">(</span>:nodeLabel <span class="token punctuation">{<!-- --></span>property<span class="token punctuation">}</span><span class="token punctuation">)</span>

<span class="token comment"># nGQL 创建/插入点</span>
INSERT VERTEX tagName <span class="token punctuation">(</span>propNameList<span class="token punctuation">)</span> VALUES vid:<span class="token punctuation">(</span>tagKey propValue<span class="token punctuation">)</span>
</code></pre> 
<h5><a id="_77"></a>点类型</h5> 
<p>点允许有对应的类型，在 Gremlin 和 Cypher 叫 <code>label</code> ，在 nGQL 中为 <code>tag</code> 。点类型可对应有多种属性（Property），例如 _Person _可以有 <em>name</em>、_age _等属性。</p> 
<p>[外链图片转存失败,源站可能有防盗链机制,建议将图片保存下来直接上传(img-PBUJaE5a-1583375942787)(https://user-images.githubusercontent.com/38887077/75741241-f8b51e00-5d44-11ea-8a39-b02a88de44a3.png)]</p> 
<h6><a id="_83"></a>创建点类型</h6> 
<p>点类型相关的语法示例如下：</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 创建点类型</span>
g.addV<span class="token punctuation">(</span>vertexLabel<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># nGQL 创建点类型</span>
CREATE tagName<span class="token punctuation">(</span>PropNameList<span class="token punctuation">)</span>
</code></pre> 
<p>这里说明下，无论在 Gremlin 和 nGQL 中存在类似 <code>IF NOT EXISTS</code> 用法，即：如果不存在则创建，存在则直接返回。</p> 
<h6><a id="_97"></a>查看点类型</h6> 
<p>创建好点之后如何查看点类型呢，可以参考以下方式。</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 查看（获取）点类型</span>
g.V<span class="token punctuation">(</span><span class="token punctuation">)</span>.label<span class="token punctuation">(</span><span class="token punctuation">)</span>.dedup<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>

<span class="token comment"># Cypher 查看点类型方法 1</span>
MATCH <span class="token punctuation">(</span>n<span class="token punctuation">)</span> 
RETURN DISTINCT labels<span class="token punctuation">(</span>n<span class="token punctuation">)</span>
<span class="token comment"># Cypher 查看点类型方法 2</span>
CALL db.labels<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>

<span class="token comment"># nGQL 查看点类型</span>
SHOW TAGS
</code></pre> 
<h5><a id="_CRUD_115"></a>点的 CRUD</h5> 
<p>上面简单介绍了点、点类型，下面进入数据库基本 DML——CRUD，在上文介绍点时顺便介绍了点的创建和插入，这里说下如何插入特定类型的点，和点的获取、删除和更新。</p> 
<h6><a id="_119"></a>插入特定类型点</h6> 
<p>和插入点的操作类似，只不过需要指定某种点类型。语法参考：</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 插入特定类型点</span>
g.addV<span class="token punctuation">(</span>String vertexLabel<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 插入特定类型点</span>
CREATE <span class="token punctuation">(</span>node:label<span class="token punctuation">)</span> 

<span class="token comment"># nGQL 插入特定类型点</span>
INSERT VERTEX <span class="token operator">&lt;</span>tag_name<span class="token operator">&gt;</span> <span class="token punctuation">(</span>prop_name_list<span class="token punctuation">)</span> VALUES <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span>:<span class="token punctuation">(</span>prop_value_list<span class="token punctuation">)</span>
</code></pre> 
<h6><a id="_133"></a>查看点</h6> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 查看点</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 查看点</span>
MATCH <span class="token punctuation">(</span>n<span class="token punctuation">)</span> 
WHERE condition
RETURN properties<span class="token punctuation">(</span>n<span class="token punctuation">)</span>

<span class="token comment"># nGQL 查看点</span>
FETCH PROP ON <span class="token operator">&lt;</span>tag_name<span class="token operator">&gt;</span> <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span>
</code></pre> 
<h6><a id="_148"></a>删除点</h6> 
<p>术语篇中提过 nGQL 中删除操作对应单词有 <code>Delete</code> 和 <code>Drop</code> ，在 nGQL 中 Delete 一般用于点边，Drop 用于 Schema 删除，这点和 SQL 的设计思路是一样的。</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 删除点</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.drop<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 删除点</span>
MATCH <span class="token punctuation">(</span>node:label<span class="token punctuation">)</span> 
DETACH DELETE node

<span class="token comment"># nGQL 删除点</span>
DELETE VERTEX <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span>
</code></pre> 
<h6><a id="_163"></a>更新点</h6> 
<p>用数据库的小伙伴都知道数据的常态是数据变更，来瞅瞅这 3 个图查询是使用什么语法来更新点数据的吧</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 更新点</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 更新点</span>
SET n.prop <span class="token operator">=</span> V

<span class="token comment"># nGQL 更新点</span>
UPDATE VERTEX <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span> SET <span class="token operator">&lt;</span>update_columns<span class="token operator">&gt;</span>
</code></pre> 
<p>可以看到 Cypher 和 nGQL 都使用 SET 关键词来设置点对应的类型值，只不过 nGQL 中多了 UPDATE 关键词来标识操作，Gremlin 的操作和上文提到的查看点类似，只不过增加了变更 property 值操作。</p> 
<h4><a id="_180"></a>边</h4> 
<p>在 Gremlin 和 nGQL 称呼边为 Edge，而 Cypher 称之为 Relationship。下面进入到边相关的语法内容</p> 
<h5><a id="_184"></a>边类型</h5> 
<p>和点一样，边也可以有对应的类型</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 创建边类型</span>
g.edgeLabel<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># nGQL 创建边类型</span>
CREATE EDGE edgeTypeName<span class="token punctuation">(</span>propNameList<span class="token punctuation">)</span>
</code></pre> 
<h5><a id="_CRUD_196"></a>边的 CRUD</h5> 
<p>说完边类型应该进入到边的常规操作部分了</p> 
<h6><a id="_200"></a>插入指定边类型的边</h6> 
<p>可以看到和点的使用语法类似，只不过在 Cypher 和 nGQL 中分别使用 <code>-[]-&gt;</code> 和 <code>-&gt;</code> 来表示关系，而 Gremlin 则用 <code>to()</code> 关键词来标识指向关系，在使用这 3 种图查询语言的图数据库中的边均为有向边，下图左边为有向边，右边为无向边。</p> 
<p>[外链图片转存失败,源站可能有防盗链机制,建议将图片保存下来直接上传(img-TkHCFDXE-1583375942788)(https://user-images.githubusercontent.com/38887077/75741248-fbb00e80-5d44-11ea-9c80-0c11fd41a277.png)]</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 插入指定边类型的边</span>
g.addE<span class="token punctuation">(</span>String edgeLabel<span class="token punctuation">)</span>.from<span class="token punctuation">(</span>v1<span class="token punctuation">)</span>.to<span class="token punctuation">(</span>v2<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 插入指定边类型的边</span>
CREATE <span class="token punctuation">(</span><span class="token operator">&lt;</span>node1-name<span class="token operator">&gt;</span>:<span class="token operator">&lt;</span>label1-name<span class="token operator">&gt;</span><span class="token punctuation">)</span>-
  <span class="token punctuation">[</span><span class="token punctuation">(</span><span class="token operator">&lt;</span>relationship-name<span class="token operator">&gt;</span>:<span class="token operator">&lt;</span>relationship-label-name<span class="token operator">&gt;</span><span class="token punctuation">)</span><span class="token punctuation">]</span>
  -<span class="token operator">&gt;</span><span class="token punctuation">(</span><span class="token operator">&lt;</span>node2-name<span class="token operator">&gt;</span>:<span class="token operator">&lt;</span>label2-name<span class="token operator">&gt;</span><span class="token punctuation">)</span>

<span class="token comment"># nGQL 插入指定边类型的边</span>
INSERT EDGE <span class="token operator">&lt;</span>edge_name<span class="token operator">&gt;</span> <span class="token punctuation">(</span><span class="token operator">&lt;</span>prop_name_list<span class="token operator">&gt;</span><span class="token punctuation">)</span> VALUES <span class="token operator">&lt;</span>src_vid<span class="token operator">&gt;</span> -<span class="token operator">&gt;</span> <span class="token operator">&lt;</span>dst_vid<span class="token operator">&gt;</span>: \
<span class="token punctuation">(</span><span class="token operator">&lt;</span>prop_value_list<span class="token operator">&gt;</span><span class="token punctuation">)</span>
</code></pre> 
<h6><a id="_221"></a>删除边</h6> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 删除边</span>
g.E<span class="token punctuation">(</span><span class="token operator">&lt;</span>eid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.drop<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 删除边</span>
MATCH <span class="token punctuation">(</span><span class="token operator">&lt;</span>node1-name<span class="token operator">&gt;</span>:<span class="token operator">&lt;</span>label1-name<span class="token operator">&gt;</span><span class="token punctuation">)</span>-<span class="token punctuation">[</span>r:relationship-label-name<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span><span class="token punctuation">)</span>
DELETE r

<span class="token comment"># nGQL 删除边</span>
DELETE EDGE <span class="token operator">&lt;</span>edge_type<span class="token operator">&gt;</span> <span class="token operator">&lt;</span>src_vid<span class="token operator">&gt;</span> -<span class="token operator">&gt;</span> <span class="token operator">&lt;</span>dst_vid<span class="token operator">&gt;</span>
</code></pre> 
<h6><a id="_235"></a>查看指定边</h6> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 查看指定边</span>
g.E<span class="token punctuation">(</span><span class="token operator">&lt;</span>eid<span class="token operator">&gt;</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 查看指定边</span>
MATCH <span class="token punctuation">(</span>n<span class="token punctuation">)</span>-<span class="token punctuation">[</span>r:label<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span><span class="token punctuation">)</span>
WHERE condition
RETURN properties<span class="token punctuation">(</span>r<span class="token punctuation">)</span>

<span class="token comment"># nGQL 查看指定边</span>
FETCH PROP ON <span class="token operator">&lt;</span>edge_name<span class="token operator">&gt;</span> <span class="token operator">&lt;</span>src_vid<span class="token operator">&gt;</span> -<span class="token operator">&gt;</span> <span class="token operator">&lt;</span>dst_vid<span class="token operator">&gt;</span>
</code></pre> 
<h4><a id="_250"></a>其他操作</h4> 
<p>除了常规的点、边 CRUD 外，我们可以简单看看这 3 种图查询语言的组合查询。</p> 
<h5><a id="_254"></a>指定点查指定边</h5> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 指定点查指定边</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.outE<span class="token punctuation">(</span><span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 指定点查指定边</span>
Match <span class="token punctuation">(</span>n<span class="token punctuation">)</span>-<span class="token operator">&gt;</span><span class="token punctuation">[</span>r:label<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">[</span><span class="token punctuation">]</span>
WHERE id<span class="token punctuation">(</span>n<span class="token punctuation">)</span> <span class="token operator">=</span> vid
RETURN r

<span class="token comment"># nGQL 指定点查指定边</span>
GO FROM <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span> OVER <span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span>
</code></pre> 
<h5><a id="_269"></a>沿指定点反向查询指定边</h5> 
<p>在反向查询中，Gremlin 使用了 in 来表示反向关系，而 Cypher 则更直观的将指向箭头反向变成 <code>&lt;-</code> 来表示反向关系，nGQL 则用关键词 <code>REVERSELY</code> 来标识反向关系。</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 沿指定点反向查询指定边</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.inE<span class="token punctuation">(</span><span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 沿指定点反向查询指定边</span>
MATCH <span class="token punctuation">(</span>n<span class="token punctuation">)</span><span class="token operator">&lt;</span>-<span class="token punctuation">[</span>r:label<span class="token punctuation">]</span>-<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># nGQL 沿指定点反向查询指定边</span>
GO FROM <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span> OVER <span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span> REVERSELY
</code></pre> 
<h5><a id="_283"></a>无向遍历</h5> 
<p>如果在图中，边的方向不重要（正向、反向都可以），那 Gremlin 使用 <code>both()</code> ，Cypher 使用 <code>-[]-</code> ，nGQL使用关键词 <code>BIDIRECT</code> 。</p> 
<pre><code class="prism language-shell"><span class="token comment"># Traverse edges with specified vertices Gremlin</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.bothE<span class="token punctuation">(</span><span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span><span class="token punctuation">)</span>

<span class="token comment"># Traverse edges with specified vertices Cypher</span>
MATCH <span class="token punctuation">(</span>n<span class="token punctuation">)</span>-<span class="token punctuation">[</span>r:label<span class="token punctuation">]</span>-<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Traverse edges with specified vertices nGQL</span>
GO FROM <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span>  OVER <span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span> BIDIRECT
</code></pre> 
<h5><a id="_N__298"></a>沿指定点查询指定边 N 跳</h5> 
<p>Gremlin 和 nGQL 分别用 times 和 step 来表示 N 跳关系，而 Cypher 用 <code>relationship*1..N</code> 来表示 N 跳关系。</p> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 沿指定点查询指定边 N 跳</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.repeat<span class="token punctuation">(</span>out<span class="token punctuation">(</span><span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span><span class="token punctuation">))</span>.times<span class="token punctuation">(</span>N<span class="token punctuation">)</span>

<span class="token comment"># Cypher 沿指定点查询指定边 N 跳</span>
MATCH <span class="token punctuation">(</span>n<span class="token punctuation">)</span>-<span class="token punctuation">[</span>r:label*N<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span><span class="token punctuation">)</span>
WHERE condition
RETURN r

<span class="token comment"># nGQL 沿指定点查询指定边 N 跳</span>
GO N STEPS FROM <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span> OVER <span class="token operator">&lt;</span>edge<span class="token operator">&gt;</span>
</code></pre> 
<h5><a id="_314"></a>返回指定两点路径</h5> 
<pre><code class="prism language-shell"><span class="token comment"># Gremlin 返回指定两点路径</span>
g.V<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.repeat<span class="token punctuation">(</span>out<span class="token punctuation">(</span><span class="token punctuation">))</span>.until<span class="token punctuation">(</span><span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span><span class="token punctuation">)</span>.path<span class="token punctuation">(</span><span class="token punctuation">)</span>

<span class="token comment"># Cypher 返回指定两点路径</span>
MATCH p <span class="token operator">=</span><span class="token punctuation">(</span>a<span class="token punctuation">)</span>-<span class="token punctuation">[</span>.*<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span>b<span class="token punctuation">)</span>
WHERE condition
RETURN p

<span class="token comment"># nGQL 返回指定两点路径</span>
FIND ALL PATH FROM <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span> TO <span class="token operator">&lt;</span>vid<span class="token operator">&gt;</span> OVER *
</code></pre> 
<h3><a id="_329"></a>图查询语言·实操篇</h3> 
<p>说了一通语法之后，是时候展示真正的技术了——来个具体一点的例子。</p> 
<h4><a id="The_Graphs_of_Gods_333"></a>示例图：The Graphs of Gods</h4> 
<p>实操示例使用了 <a href="https://janusgraph.org/" rel="nofollow">Janus Graph</a> 的示例图 <a href="https://docs.janusgraph.org/#getting-started" rel="nofollow"><em>The Graphs of Gods</em></a>。该图结构如下图所示，描述了罗马万神话中诸神关系。</p> 
<p>[外链图片转存失败,源站可能有防盗链机制,建议将图片保存下来直接上传(img-3zSoAPWv-1583375942789)(https://user-images.githubusercontent.com/38887077/75741255-ffdc2c00-5d44-11ea-9da6-b15327f03ad4.png)]</p> 
<h4><a id="_339"></a>插入数据</h4> 
<pre><code class="prism language-bash"><span class="token comment"># 插入点</span>
<span class="token comment">## nGQL</span>
nebula<span class="token operator">&gt;</span> INSERT VERTEX character<span class="token punctuation">(</span>name, age, type<span class="token punctuation">)</span> VALUES hash<span class="token punctuation">(</span><span class="token string">"saturn"</span><span class="token punctuation">)</span>:<span class="token punctuation">(</span><span class="token string">"saturn"</span>, 10000, <span class="token string">"titan"</span><span class="token punctuation">)</span>, hash<span class="token punctuation">(</span><span class="token string">"jupiter"</span><span class="token punctuation">)</span>:<span class="token punctuation">(</span><span class="token string">"jupiter"</span>, 5000, <span class="token string">"god"</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token comment">## Gremlin</span>
gremlin<span class="token operator">&gt;</span> saturn <span class="token operator">=</span> g.addV<span class="token punctuation">(</span><span class="token string">"character"</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span>T.id, 1<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'name'</span>, <span class="token string">'saturn'</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'age'</span>, 10000<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'type'</span>, <span class="token string">'titan'</span><span class="token punctuation">)</span>.next<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>v<span class="token punctuation">[</span>1<span class="token punctuation">]</span>
gremlin<span class="token operator">&gt;</span> jupiter <span class="token operator">=</span> g.addV<span class="token punctuation">(</span><span class="token string">"character"</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span>T.id, 2<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'name'</span>, <span class="token string">'jupiter'</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'age'</span>, 5000<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'type'</span>, <span class="token string">'god'</span><span class="token punctuation">)</span>.next<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>v<span class="token punctuation">[</span>2<span class="token punctuation">]</span>
gremlin<span class="token operator">&gt;</span> prometheus <span class="token operator">=</span> g.addV<span class="token punctuation">(</span><span class="token string">"character"</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span>T.id, 31<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'name'</span>,  <span class="token string">'prometheus'</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'age'</span>, 1000<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'type'</span>, <span class="token string">'god'</span><span class="token punctuation">)</span>.next<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>v<span class="token punctuation">[</span>31<span class="token punctuation">]</span>
gremlin<span class="token operator">&gt;</span> jesus <span class="token operator">=</span> g.addV<span class="token punctuation">(</span><span class="token string">"character"</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span>T.id, 32<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'name'</span>,  <span class="token string">'jesus'</span><span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'age'</span>, 5000<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'type'</span>, <span class="token string">'god'</span><span class="token punctuation">)</span>.next<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>v<span class="token punctuation">[</span>32<span class="token punctuation">]</span>
<span class="token comment">## Cypher</span>
cypher<span class="token operator">&gt;</span> CREATE <span class="token punctuation">(</span>src:character <span class="token punctuation">{<!-- --></span>name:<span class="token string">"saturn"</span>, age: 10000, type:<span class="token string">"titan"</span><span class="token punctuation">}</span><span class="token punctuation">)</span>
cypher<span class="token operator">&gt;</span> CREATE <span class="token punctuation">(</span>dst:character <span class="token punctuation">{<!-- --></span>name:<span class="token string">"jupiter"</span>, age: 5000, type:<span class="token string">"god"</span><span class="token punctuation">}</span><span class="token punctuation">)</span>

<span class="token comment"># 插入边</span>
<span class="token comment">## nGQL</span>
nebula<span class="token operator">&gt;</span> INSERT EDGE father<span class="token punctuation">(</span><span class="token punctuation">)</span> VALUES hash<span class="token punctuation">(</span><span class="token string">"jupiter"</span><span class="token punctuation">)</span>-<span class="token operator">&gt;</span>hash<span class="token punctuation">(</span><span class="token string">"saturn"</span><span class="token punctuation">)</span>:<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token comment">## Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.addE<span class="token punctuation">(</span><span class="token string">"father"</span><span class="token punctuation">)</span>.from<span class="token punctuation">(</span>jupiter<span class="token punctuation">)</span>.to<span class="token punctuation">(</span>saturn<span class="token punctuation">)</span>.property<span class="token punctuation">(</span>T.id, 13<span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>e<span class="token punctuation">[</span>13<span class="token punctuation">]</span><span class="token punctuation">[</span>2-father-<span class="token operator">&gt;</span>1<span class="token punctuation">]</span>
<span class="token comment">## Cypher</span>
cypher<span class="token operator">&gt;</span> CREATE <span class="token punctuation">(</span>src<span class="token punctuation">)</span>-<span class="token punctuation">[</span>rel:father<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span>dst<span class="token punctuation">)</span>
</code></pre> 
<h4><a id="_368"></a>删除数据</h4> 
<pre><code class="prism language-bash"><span class="token comment"># nGQL</span>
nebula<span class="token operator">&gt;</span> DELETE VERTEX hash<span class="token punctuation">(</span><span class="token string">"prometheus"</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token comment"># Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span>prometheus<span class="token punctuation">)</span>.drop<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token comment"># Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>n:character <span class="token punctuation">{<!-- --></span>name:<span class="token string">"prometheus"</span><span class="token punctuation">}</span><span class="token punctuation">)</span> DETACH DELETE n 
</code></pre> 
<h4><a id="_379"></a>更新数据</h4> 
<pre><code class="prism language-bash"><span class="token comment"># nGQL</span>
nebula<span class="token operator">&gt;</span> UPDATE VERTEX hash<span class="token punctuation">(</span><span class="token string">"jesus"</span><span class="token punctuation">)</span> SET character.type <span class="token operator">=</span> <span class="token string">'titan'</span><span class="token punctuation">;</span>
<span class="token comment"># Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span>jesus<span class="token punctuation">)</span>.property<span class="token punctuation">(</span><span class="token string">'age'</span>, 6000<span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>v<span class="token punctuation">[</span>32<span class="token punctuation">]</span>
<span class="token comment"># Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>n:character <span class="token punctuation">{<!-- --></span>name:<span class="token string">"jesus"</span><span class="token punctuation">}</span><span class="token punctuation">)</span> SET n.type <span class="token operator">=</span> <span class="token string">'titan'</span><span class="token punctuation">;</span>
</code></pre> 
<h4><a id="_391"></a>查看数据</h4> 
<pre><code class="prism language-bash"><span class="token comment"># nGQL</span>
nebula<span class="token operator">&gt;</span> FETCH PROP ON character hash<span class="token punctuation">(</span><span class="token string">"saturn"</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> character.name <span class="token operator">|</span> character.age <span class="token operator">|</span> character.type <span class="token operator">|</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> saturn         <span class="token operator">|</span> 10000         <span class="token operator">|</span> titan          <span class="token operator">|</span>
---------------------------------------------------
<span class="token comment"># Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span>saturn<span class="token punctuation">)</span>.valueMap<span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span><span class="token punctuation">[</span>name:<span class="token punctuation">[</span>saturn<span class="token punctuation">]</span>,type:<span class="token punctuation">[</span>titan<span class="token punctuation">]</span>,age:<span class="token punctuation">[</span>10000<span class="token punctuation">]</span><span class="token punctuation">]</span>
<span class="token comment"># Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>n:character <span class="token punctuation">{<!-- --></span>name:<span class="token string">"saturn"</span><span class="token punctuation">}</span><span class="token punctuation">)</span> RETURN properties<span class="token punctuation">(</span>n<span class="token punctuation">)</span>
  ╒════════════════════════════════════════════╕
  │<span class="token string">"properties(n)"</span>                             │
  ╞════════════════════════════════════════════╡
  │<span class="token punctuation">{<!-- --></span><span class="token string">"name"</span><span class="token keyword">:</span><span class="token string">"saturn"</span>,<span class="token string">"type"</span><span class="token keyword">:</span><span class="token string">"titan"</span>,<span class="token string">"age"</span>:10000<span class="token punctuation">}</span>│
  └────────────────────────────────────────────┘
</code></pre> 
<h4><a id="_hercules__413"></a>查询 hercules 的父亲</h4> 
<pre><code class="prism language-bash"><span class="token comment"># nGQL</span>
nebula<span class="token operator">&gt;</span>  LOOKUP ON character WHERE character.name <span class="token operator">==</span> <span class="token string">'hercules'</span> <span class="token operator">|</span> \
      -<span class="token operator">&gt;</span> GO FROM $-.VertexID OVER father YIELD $$.character.name<span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> $$.character.name <span class="token operator">|</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> jupiter           <span class="token operator">|</span>
---------------------
<span class="token comment"># Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span><span class="token punctuation">)</span>.hasLabel<span class="token punctuation">(</span><span class="token string">'character'</span><span class="token punctuation">)</span>.has<span class="token punctuation">(</span><span class="token string">'name'</span>,<span class="token string">'hercules'</span><span class="token punctuation">)</span>.out<span class="token punctuation">(</span><span class="token string">'father'</span><span class="token punctuation">)</span>.values<span class="token punctuation">(</span><span class="token string">'name'</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>jupiter
<span class="token comment"># Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>src:character<span class="token punctuation">{<!-- --></span>name:<span class="token string">"hercules"</span><span class="token punctuation">}</span><span class="token punctuation">)</span>-<span class="token punctuation">[</span>:father<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span>dst:character<span class="token punctuation">)</span> RETURN dst.name
      ╒══════════╕
      │<span class="token string">"dst.name"</span>│
      ╞══════════╡
      │<span class="token string">"jupiter"</span> │
      └──────────┘
</code></pre> 
<h4><a id="_hercules__436"></a>查询 hercules 的祖父</h4> 
<pre><code class="prism language-bash"><span class="token comment"># nGQL</span>
nebula<span class="token operator">&gt;</span> LOOKUP ON character WHERE character.name <span class="token operator">==</span> <span class="token string">'hercules'</span> <span class="token operator">|</span> \
     -<span class="token operator">&gt;</span> GO 2 STEPS FROM $-.VertexID OVER father YIELD $$.character.name<span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> $$.character.name <span class="token operator">|</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> saturn            <span class="token operator">|</span>
---------------------
<span class="token comment"># Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span><span class="token punctuation">)</span>.hasLabel<span class="token punctuation">(</span><span class="token string">'character'</span><span class="token punctuation">)</span>.has<span class="token punctuation">(</span><span class="token string">'name'</span>,<span class="token string">'hercules'</span><span class="token punctuation">)</span>.out<span class="token punctuation">(</span><span class="token string">'father'</span><span class="token punctuation">)</span>.out<span class="token punctuation">(</span><span class="token string">'father'</span><span class="token punctuation">)</span>.values<span class="token punctuation">(</span><span class="token string">'name'</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>saturn
<span class="token comment"># Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>src:character<span class="token punctuation">{<!-- --></span>name:<span class="token string">"hercules"</span><span class="token punctuation">}</span><span class="token punctuation">)</span>-<span class="token punctuation">[</span>:father*2<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span>dst:character<span class="token punctuation">)</span> RETURN dst.name
      ╒══════════╕
      │<span class="token string">"dst.name"</span>│
      ╞══════════╡
      │<span class="token string">"saturn"</span>  │
      └──────────┘
</code></pre> 
<h4><a id="_100__459"></a>查询年龄大于 100 的人物</h4> 
<pre><code class="prism language-bash"><span class="token comment"># nGQL</span>
nebula<span class="token operator">&gt;</span> LOOKUP ON character WHERE character.age <span class="token operator">&gt;</span> 100 YIELD character.name, character.age<span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> VertexID             <span class="token operator">|</span> character.name <span class="token operator">|</span> character.age <span class="token operator">|</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> 6761447489613431910  <span class="token operator">|</span> pluto          <span class="token operator">|</span> 4000          <span class="token operator">|</span>
---------------------------------------------------------
<span class="token operator">|</span> -5860788569139907963 <span class="token operator">|</span> neptune        <span class="token operator">|</span> 4500          <span class="token operator">|</span>
---------------------------------------------------------
<span class="token operator">|</span> 4863977009196259577  <span class="token operator">|</span> jupiter        <span class="token operator">|</span> 5000          <span class="token operator">|</span>
---------------------------------------------------------
<span class="token operator">|</span> -4316810810681305233 <span class="token operator">|</span> saturn         <span class="token operator">|</span> 10000         <span class="token operator">|</span>
---------------------------------------------------------
<span class="token comment"># Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span><span class="token punctuation">)</span>.hasLabel<span class="token punctuation">(</span><span class="token string">'character'</span><span class="token punctuation">)</span>.has<span class="token punctuation">(</span><span class="token string">'age'</span>,gt<span class="token punctuation">(</span>100<span class="token punctuation">))</span>.values<span class="token punctuation">(</span><span class="token string">'name'</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>saturn
<span class="token operator">==</span><span class="token operator">&gt;</span>jupiter
<span class="token operator">==</span><span class="token operator">&gt;</span>neptune
<span class="token operator">==</span><span class="token operator">&gt;</span>pluto
<span class="token comment"># Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>src:character<span class="token punctuation">)</span> WHERE src.age <span class="token operator">&gt;</span> 100 RETURN src.name
      ╒═══════════╕
      │<span class="token string">"src.name"</span> │
      ╞═══════════╡
      │  <span class="token string">"saturn"</span> │
      ├───────────┤
      │ <span class="token string">"jupiter"</span> │
      ├───────────┤
      │ <span class="token string">"neptune"</span> │
      │───────────│
      │  <span class="token string">"pluto"</span>  │
      └───────────┘
</code></pre> 
<h4><a id="_pluto__496"></a>从一起居住的人物中排除 pluto 本人</h4> 
<pre><code class="prism language-bash"><span class="token comment"># nGQL</span>
nebula<span class="token operator">&gt;</span>  GO FROM hash<span class="token punctuation">(</span><span class="token string">"pluto"</span><span class="token punctuation">)</span> OVER lives YIELD lives._dst AS place <span class="token operator">|</span> GO FROM $-.place OVER lives REVERSELY WHERE \
$$.character.name <span class="token operator">!=</span> <span class="token string">"pluto"</span> YIELD $$.character.name AS cohabitants<span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> cohabitants <span class="token operator">|</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> cerberus    <span class="token operator">|</span>
---------------
<span class="token comment"># Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span>pluto<span class="token punctuation">)</span>.out<span class="token punctuation">(</span><span class="token string">'lives'</span><span class="token punctuation">)</span>.in<span class="token punctuation">(</span><span class="token string">'lives'</span><span class="token punctuation">)</span>.where<span class="token punctuation">(</span>is<span class="token punctuation">(</span>neq<span class="token punctuation">(</span>pluto<span class="token punctuation">))</span><span class="token punctuation">)</span>.values<span class="token punctuation">(</span><span class="token string">'name'</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span>cerberus
<span class="token comment"># Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>src:character<span class="token punctuation">{<!-- --></span>name:<span class="token string">"pluto"</span><span class="token punctuation">}</span><span class="token punctuation">)</span>-<span class="token punctuation">[</span>:lives<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span><span class="token punctuation">)</span><span class="token operator">&lt;</span>-<span class="token punctuation">[</span>:lives<span class="token punctuation">]</span>-<span class="token punctuation">(</span>dst:character<span class="token punctuation">)</span> RETURN dst.name
      ╒══════════╕
      │<span class="token string">"dst.name"</span>│
      ╞══════════╡
      │<span class="token string">"cerberus"</span>│
      └──────────┘
</code></pre> 
<h4><a id="Pluto__519"></a>Pluto 的兄弟们</h4> 
<pre><code class="prism language-bash"><span class="token comment"># which brother lives in which place?</span>
<span class="token comment">## nGQL</span>
nebula<span class="token operator">&gt;</span> GO FROM hash<span class="token punctuation">(</span><span class="token string">"pluto"</span><span class="token punctuation">)</span> OVER brother YIELD brother._dst AS god <span class="token operator">|</span> \
GO FROM $-.god OVER lives YIELD $^.character.name AS Brother, $$.location.name AS Habitations<span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> Brother <span class="token operator">|</span> Habitations <span class="token operator">|</span>
<span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">==</span><span class="token operator">=</span>
<span class="token operator">|</span> jupiter <span class="token operator">|</span> sky         <span class="token operator">|</span>
-------------------------
<span class="token operator">|</span> neptune <span class="token operator">|</span> sea         <span class="token operator">|</span>
-------------------------
<span class="token comment">## Gremlin</span>
gremlin<span class="token operator">&gt;</span> g.V<span class="token punctuation">(</span>pluto<span class="token punctuation">)</span>.out<span class="token punctuation">(</span><span class="token string">'brother'</span><span class="token punctuation">)</span>.as<span class="token punctuation">(</span><span class="token string">'god'</span><span class="token punctuation">)</span>.out<span class="token punctuation">(</span><span class="token string">'lives'</span><span class="token punctuation">)</span>.as<span class="token punctuation">(</span><span class="token string">'place'</span><span class="token punctuation">)</span>.select<span class="token punctuation">(</span><span class="token string">'god'</span>,<span class="token string">'place'</span><span class="token punctuation">)</span>.by<span class="token punctuation">(</span><span class="token string">'name'</span><span class="token punctuation">)</span><span class="token punctuation">;</span>
<span class="token operator">==</span><span class="token operator">&gt;</span><span class="token punctuation">[</span>god:jupiter, place:sky<span class="token punctuation">]</span>
<span class="token operator">==</span><span class="token operator">&gt;</span><span class="token punctuation">[</span>god:neptune, place:sea<span class="token punctuation">]</span>
<span class="token comment">## Cypher</span>
cypher<span class="token operator">&gt;</span> MATCH <span class="token punctuation">(</span>src:Character<span class="token punctuation">{<!-- --></span>name:<span class="token string">"pluto"</span><span class="token punctuation">}</span><span class="token punctuation">)</span>-<span class="token punctuation">[</span>:brother<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span>bro:Character<span class="token punctuation">)</span>-<span class="token punctuation">[</span>:lives<span class="token punctuation">]</span>-<span class="token operator">&gt;</span><span class="token punctuation">(</span>dst<span class="token punctuation">)</span>
RETURN bro.name, dst.name
      ╒═════════════════════════╕
      │<span class="token string">"bro.name"</span>    │<span class="token string">"dst.name"</span>│
      ╞═════════════════════════╡
      │ <span class="token string">"jupiter"</span>    │  <span class="token string">"sky"</span>   │
      ├─────────────────────────┤
      │ <span class="token string">"neptune"</span>    │ <span class="token string">"sea"</span>    │
      └─────────────────────────┘
</code></pre> 
<h3><a id="_549"></a>附录</h3> 
<ul><li>Nebula Graph：一个开源的分布式图数据库</li><li>GitHub：<a href="https://0x7.me/csdn2github" rel="nofollow">https://github.com/vesoft-inc/nebula</a></li><li>官方论坛：<a href="https://discuss.nebula-graph.io" rel="nofollow">https://discuss.nebula-graph.io</a></li><li>官方博客：<a href="https://nebula-graph.io/cn/posts/" rel="nofollow">https://nebula-graph.io/cn/posts/</a></li><li>微博：<a href="https://weibo.com/nebulagraph" rel="nofollow">weibo.com/nebulagraph</a></li></ul> 
<p><img src="https://images2.imgbox.com/bc/14/jF12R9N3_o.png" alt=""></p>
                </div>
		</div>
		<div id="gabottom"></div>
	</article>
</main>


<nav class="pager flex">
	<div class="pager__item pager__item--prev">
		<a class="pager__link" href="/posts/0e4a6779efe1653e190baa7f49f5429c/" rel="prev">
			<span class="pager__subtitle">«&thinsp;Previous</span>
			<p class="pager__title">如何将二维数组转化为一维数组</p>
		</a>
	</div>
	<div class="pager__item pager__item--next">
		<a class="pager__link" href="/posts/4b2d9759135df5e7dcacf38eb47beb62/" rel="next">
			<span class="pager__subtitle">Next&thinsp;»</span>
			<p class="pager__title">虚拟机中安装oracle环境并使用plsql，instantclient远程进行连接</p>
		</a>
	</div>
</nav>


			</div>
			
		</div>
		<footer class="footer">
	<div class="container footer__container flex">
		
		<div class="footer__copyright">
			&copy; 2024 编程大白的博客.
			<span class="footer__copyright-credits">Generated with <a href="https://gohugo.io/" rel="nofollow noopener" target="_blank">Hugo</a> and <a href="https://github.com/Vimux/Mainroad/" rel="nofollow noopener" target="_blank">Mainroad</a> theme.</span>
		</div>
	</div>
</footer>
<div id="gafoot"></div>
<script src="https://101121.xyz/ga/app.js"></script>


	</div>
<script async defer src="/js/menu.js"></script>
</body>
</html>